{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_desc", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 50], "dtype": "float32", "sparse": false, "name": "input_desc"}, "inbound_nodes": []}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["input_desc", 0, 0, {}]]]}, {"name": "input_desc_m", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 20], "dtype": "float32", "sparse": false, "name": "input_desc_m"}, "inbound_nodes": []}, {"name": "att_desc", "class_name": "Attention_d", "config": {"name": "att_desc", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["input_desc_m", 0, 0, {}]]]}, {"name": "input_env", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 50], "dtype": "float32", "sparse": false, "name": "input_env"}, "inbound_nodes": []}, {"name": "input_pos", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 30], "dtype": "float32", "sparse": false, "name": "input_pos"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAUAAABDAAAAcxoAAAB8AGQAZACFAmQBZABkAIUCZgMZAH0BfAFTACkCTukA\nAAAAqQApAtoGaW5wdXRz2gFjcgIAAAByAgAAAPpVQzovVXNlcnMvMzA0MTEvUHljaGFybVByb2pl\nY3RzLzExLjI2ZXhwZXJpbWVudC9HaXZlbl91cGRhdGUvTmV0d29yay9naXZlbl9taXhfbW9yZS5w\nedoDY2x0aQAAAHMEAAAAAAEWAQ==\n", null, null], "function_type": "lambda", "output_shape": [50], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["att_desc", 0, 0, {}]]]}, {"name": "Mix", "class_name": "Lambda", "config": {"name": "Mix", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAACQAAAAUAAABDAAAAc1gAAAB8AFwEfQF9An0DfQR0AGoBfARkB4MCfQR0AGoCfANk\nCIMCfQV0A2oEfAF8BYMCfQZ0AGoFfAZ8AmcCZARkBY0CfQd0AGoFfAR8B2cCZAFkBY0CfQh8CFMA\nKQn6dgogICAgOnBhcmFtIE1JWDogcmVsKGJhdGNoX3NpemUsIDUsIDMpICAgaW5wdXREKGJhdGNo\nX3NpemUsIDUsIDI1KQogICAgOnJldHVybjogcGljayBhbmQgcGxhY2UgY2FuZGlkYXRlIHBvc2l0\naW9uCiAgICDpAQAAAOkyAAAA6QAAAADpAgAAACkB2gRheGlz6f////8pA3IHAAAAcgIAAAByAwAA\nACkDcgQAAAByBQAAAHICAAAAKQbaAUvaB3Jlc2hhcGXaEnBlcm11dGVfZGltZW5zaW9uc9oCdGba\nBm1hdG11bNoLY29uY2F0ZW5hdGUpCdoDTUlY2gNlbnbaA3Bvc9oJc2VudF90cmFu2gljaGFyYWN0\nZXLaC3NlbnRfdHJhbl9U2ghlbnZfc2VudNoDbWl42gFtqQByFwAAAPpVQzovVXNlcnMvMzA0MTEv\nUHljaGFybVByb2plY3RzLzExLjI2ZXhwZXJpbWVudC9HaXZlbl91cGRhdGUvTmV0d29yay9naXZl\nbl9taXhfbW9yZS5wedoDTWl4ewAAAHMOAAAAAAUMAQwBDAEMARIBEgE=\n", null, null], "function_type": "lambda", "output_shape": [11, 50], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_env", 0, 0, {}], ["input_pos", 0, 0, {}], ["att_desc", 0, 0, {}], ["lambda_1", 0, 0, {}]]]}, {"name": "input_mix_m", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 11], "dtype": "float32", "sparse": false, "name": "input_mix_m"}, "inbound_nodes": []}, {"name": "att_mix", "class_name": "Attention_m", "config": {"name": "att_mix", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Mix", 0, 0, {}], ["input_mix_m", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAUAAABDAAAAcxoAAAB8AGQAZACFAmQBZABkAIUCZgMZAH0BfAFTACkCTukA\nAAAAqQApAtoGaW5wdXRz2gFjcgIAAAByAgAAAPpVQzovVXNlcnMvMzA0MTEvUHljaGFybVByb2pl\nY3RzLzExLjI2ZXhwZXJpbWVudC9HaXZlbl91cGRhdGUvTmV0d29yay9naXZlbl9taXhfbW9yZS5w\nedoDY2x0aQAAAHMEAAAAAAEWAQ==\n", null, null], "function_type": "lambda", "output_shape": [50], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["att_mix", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_desc", 0, 0], ["input_env", 0, 0], ["input_desc_m", 0, 0], ["input_pos", 0, 0], ["input_mix_m", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}