{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_cmd", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25, 50], "dtype": "float32", "sparse": false, "name": "input_cmd"}, "inbound_nodes": []}, {"name": "input_cmd_m", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25, 25], "dtype": "float32", "sparse": false, "name": "input_cmd_m"}, "inbound_nodes": []}, {"name": "att", "class_name": "Attention", "config": {"name": "att", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_cmd", 0, 0, {}], ["input_cmd_m", 0, 0, {}]]]}, {"name": "input_env", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 50], "dtype": "float32", "sparse": false, "name": "input_env"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAUAAABDAAAAcxoAAAB8AGQBZAGFAmQCZAFkAYUCZgMZAH0BfAFTACkD9TYA\nAADlsIZhdHRlbnRpb27nmoTnrKzkuIDooYzovpPlh7rkvZzkuLrliIbnsbvlsYLnmoTovpPlhaVO\n6QAAAACpACkC2gZpbnB1dHPaAWFyAwAAAHIDAAAA+lBDOi9Vc2Vycy8zMDQxMS9QeWNoYXJtUHJv\namVjdHMvb3BlbnNvdXJjZS9OTFBfdXBkYXRlL1RyYW5zZm9ybWVyTk4vQ0FfbmV0d29yay5wedoD\nY2x0UgAAAHMEAAAAAAIWAQ==\n", null, null], "function_type": "lambda", "output_shape": [50], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["att", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAcyQAAAB8AFwCfQF9AnQAagF8AmQEgwJ9A3QCagN8AXwDgwJ9\nBHwEUwApBfWRAAAACiAgICBjaGFuZ2UgYW5kIGRvdCBtYXRyaXggJiAwLTEgbm9ybWFsaXplCiAg\nICBzZW50ICgtMSwgMjUsIDUwKSBubyBwb3NpdGlvbiBlbWJlZGRpbmcKICAgIFlfZGF0YSAoLTEs\nIDQsIDUwKSAg77yIaW5wdXQgbnVtLCB2aWV3IG51bSwgNTDvvIkKICAgIOkAAAAA6QIAAADpAQAA\nACkDcgIAAAByAwAAAHIEAAAAKQTaAUvaEnBlcm11dGVfZGltZW5zaW9uc9oCdGbaBm1hdG11bCkF\n2gZpbnB1dHPaA2VudtoLc2VudF9lbmNvZGXaBnNlbnRfdNoIZW52X3NlbnSpAHIOAAAA+lBDOi9V\nc2Vycy8zMDQxMS9QeWNoYXJtUHJvamVjdHMvb3BlbnNvdXJjZS9OTFBfdXBkYXRlL1RyYW5zZm9y\nbWVyTk4vQ0FfbmV0d29yay5wedoDTWl4WAAAAHMIAAAAAAYIAQwBDAE=\n", null, null], "function_type": "lambda", "output_shape": [10, 25], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_env", 0, 0, {}], ["att", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "output_rel", "class_name": "Dense", "config": {"name": "output_rel", "trainable": true, "dtype": "float32", "units": 7, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "output_role", "class_name": "Dense", "config": {"name": "output_role", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_cmd", 0, 0], ["input_cmd_m", 0, 0], ["input_env", 0, 0]], "output_layers": [["output_rel", 0, 0], ["output_role", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}